Backend/app/controllers/tipo_de_plans_controller.rb

  def index
    @tipo_de_plans = TipoDePlan.all
---
SELECT "tipo_de_plans".* FROM "tipo_de_plans"