Backend/app/controllers/tipos_de_cupos_controller.rb

  def index
    @tipos_de_cupos = TiposDeCupo.all
---
SELECT "tipos_de_cupos".* FROM "tipos_de_cupos"

  def create
    @tipos_de_cupo = TiposDeCupo.new(tipos_de_cupo_params)

    if @tipos_de_cupo.save
---
INSERT INTO "tipos_de_cupos" ("tipo_de_cupo", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tipo_de_cupo", "carros"], ["created_at", "2018-09-08 16:09:46.133327"], ["updated_at", "2018-09-08 16:09:46.133327"]]