Backend/app/controllers/usuario_token_controller.rb

    def create
        @user=Usuario.where("email = ?",params[:auth][:email]).first;
---
SELECT  "usuarios".* FROM "usuarios" WHERE (email = 'juliancmunar@gmail.com') ORDER BY "usuarios"."id" ASC LIMIT $1  [["LIMIT", 1]]