Backend/app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    if @usuario.save
---
INSERT INTO "usuarios" ("calificacion", "nombres", "apellidos", "email", "telefono", "password_digest", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"